Revit 2026 API

# ElementGetValidTypes(Document, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> GetValidTypes(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function GetValidTypes (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ GetValidTypes(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member GetValidTypes :
        document : Document *
        elementIds : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

Element Class

GetValidTypes Overload

Autodesk.Revit.DB Namespace